contextablemark/esp32-agui/agui-voice/main/agui_voice_main.c
    cJSON_Delete(tools);                           // cJSON_Delete(NULL) is safe
    if (!s_run_error) chat_ui_status(IDLE_HINT);   // success → idle prompt; on error keep "Error" up
}

// ---- PTT "go ahead and talk" beep -------------------------------------------------------------
// A short, subtle sine cue played on the ES8311 speaker the instant a hold starts. It plays from
// ptt_task BEFORE soniox_session_start() creates capture_task, so it never glitches an in-flight
// mic read. The speaker is a second esp_codec_dev OUT handle that coexists with the always-open mic
// IN handle on the single ES8311; both MUST use the same 16k/16/1 format (the shared codec/I2S
// clock's last set_fs wins — and it is NOT auto-enforced, so BEEP_SR is hard-pinned). Opening the
// speaker soft-resets the shared chip (clobbers the mic ADC gain) and its acoustic crosstalk lands
// in the live RX DMA ring — capture_task compensates by re-asserting the mic gain and draining the
// ring before it forwards any audio (see soniox_client capture_task).
#define BEEP_SR        16000   // MUST equal soniox_client DEFAULT_SR (the mic rate)
#define BEEP_MS        90      // duration of one beep
#define BEEP_FADE_MS   6       // linear fade in AND out — kills edge clicks
#define BEEP_VOL       75      // esp_codec_dev out-vol INDEX 0-100 (NOT dB; 0 would be -96 dB = silent).
                               // Shared by both tones at a known-good analog gain; loudness is set by the
                               // digital amplitude below, so neither tone overdrives the PA.
// Two tones share the speaker: a SUBTLE PTT "go ahead" cue and a LOUDER, higher-pitched timer alarm.
// Loudness ≈ amplitude / 32767 of full scale (clean headroom — alarm can go toward ~30000 for more).
#define CUE_FREQ       950     // Hz — subtle mid tone for the PTT cue
#define CUE_AMPL       6000    // ~0.18 FS — subtle (unchanged)
#define ALARM_FREQ     1760    // Hz — higher pitched, more attention-getting (loudness ramps in
                               // run_timer_alarm via ALARM_LEVELS, so there's no fixed alarm amplitude)
#define BEEP_SAMPLES   (BEEP_SR * BEEP_MS / 1000)        // 1440
#define BEEP_FADE_N    (BEEP_SR * BEEP_FADE_MS / 1000)   // 96

#ifndef M_PI
#define M_PI 3.14159265358979323846
#endif

static esp_codec_dev_handle_t s_spk;              // speaker OUT handle, opened once and kept open
static int16_t s_cue_pcm[BEEP_SAMPLES];           // PTT cue (subtle)
static int16_t s_alarm_pcm[BEEP_SAMPLES];         // timer alarm (loud, higher)
static bool    s_beep_ready;

// Fill `buf` with a `freq` sine at 16k mono, linear fade-in/out on the edges so the buffer's
// start/end discontinuities don't click. Peak ±ampl; keep ampl < 32767 so it can't digitally clip.
static void fill_tone(int16_t *buf, int freq, int ampl)
{
    const double w = 2.0 * M_PI * (double)freq / (double)BEEP_SR;
    for (int i = 0; i < BEEP_SAMPLES; i++) {
        double env = 1.0;                                            // anti-click amplitude envelope
        if (i < BEEP_FADE_N)                       env = (double)i / BEEP_FADE_N;
        else if (i >= BEEP_SAMPLES - BEEP_FADE_N)  env = (double)(BEEP_SAMPLES - 1 - i) / BEEP_FADE_N;
        buf[i] = (int16_t)lrint(sin(w * i) * env * ampl);
    }
}

// Lazily bring up the speaker (once) and play one precomputed tone. Blocks (~90 ms) until it is
// clocked out of the I2S TX DMA. Call ONLY from a task (ptt_task / timer task), never a button cb.
static void play_beep(const int16_t *pcm)
{
    if (!s_beep_ready) {                            // build the cue once; run_timer_alarm (re)fills the
        fill_tone(s_cue_pcm, CUE_FREQ, CUE_AMPL);   // alarm buffer at its current escalation level
        s_beep_ready = true;
    }
    if (!s_spk) {
        s_spk = bsp_audio_codec_speaker_init();                 // pa_pin = GPIO46, raised automatically
        if (!s_spk) { ESP_LOGW(TAG, "beep: speaker init failed"); return; }
        esp_codec_dev_set_out_vol(s_spk, BEEP_VOL);             // 0-100 index, NOT dB
        esp_codec_dev_sample_info_t fs = { .bits_per_sample = 16, .channel = 1, .sample_rate = BEEP_SR };
        if (esp_codec_dev_open(s_spk, &fs) != ESP_OK) {         // same 16k as the mic → full-duplex OK
            ESP_LOGW(TAG, "beep: speaker open failed");
            s_spk = NULL;                                       // retry on the next call
            return;
        }
        ESP_LOGI(TAG, "beep: speaker ready (16k mono)");
    }
    esp_codec_dev_write(s_spk, (int16_t *)pcm, BEEP_SAMPLES * sizeof(int16_t));   // API wants non-const
}

static void play_ptt_beep(void) { play_beep(s_cue_pcm); }   // PTT "go ahead" cue (existing call sites)

// --- Idle low-power: shed WiFi when the display is off AND on battery ------------------------------
// Driven by the display-state hook (chat_ui_set_power_cb): the screen-power saver blanks the display
// on battery -> WiFi radio off; on wake -> WiFi back. Plugged-in stays connected + instant. The
// set_timer still fires + rings from this state (no WiFi). A PTT press also wakes WiFi (lp_wake) and
// then waits for the link before opening Soniox. lp_wake runs from two tasks, so it is guarded.
static volatile bool s_lp_suspended;
static portMUX_TYPE  s_lp_mux = portMUX_INITIALIZER_UNLOCKED;

static void lp_wake(void)   // bring WiFi back if it was shed; exactly-once (screen task OR ptt task)
{
    bool go = false;
    portENTER_CRITICAL(&s_lp_mux);
    if (s_lp_suspended) { s_lp_suspended = false; go = true; }
    portEXIT_CRITICAL(&s_lp_mux);
    if (go) net_wifi_resume();
}

static void lp_idle(void)   // shed WiFi when idle — only on battery (plugged-in stays connected)
{
    if (s_lp_suspended || !device_tools_on_battery()) return;   // I2C read kept outside the critical section
    s_lp_suspended = true;
    net_wifi_suspend();
}

static void lp_set(bool display_on)   // chat_ui display-state hook (runs on the screen-power task)
{
    if (display_on) lp_wake();
    else            lp_idle();
}

// PTT state machine: press → open STT + stream; release → stop, assemble the utterance, run it.
static void ptt_task(void *arg)
{
    for (;;) {
        int ev;
        if (xQueueReceive(s_ptt_q, &ev, portMAX_DELAY) != pdTRUE) continue;

        if (ev == 1 && !s_listening) {                 // PRESS
            s_ptt_final[0] = '\0';
            s_ptt_run[0]   = '\0';
            s_listening = true;
            lp_wake();                                 // woke from WiFi-off idle? bring the radio back…
            if (!net_is_connected()) {                 // …and wait for the link before streaming to Soniox
                chat_ui_status("Connecting...");
                for (int i = 0; i < 100 && !net_is_connected(); i++) vTaskDelay(pdMS_TO_TICKS(50)); // ~5s
            }
            if (!net_is_connected()) {                 // gave up → don't open a doomed session
                s_listening = false;
                chat_ui_status("No WiFi");
                ESP_LOGW(TAG, "wake: WiFi did not reconnect");
                continue;
            }
            net_low_latency(true);                     // low-latency WiFi for the whole turn (mic + reply)
            chat_ui_status("Listening...");
            play_ptt_beep();                           // "go ahead" cue; plays & returns before capture starts
            soniox_cfg_t scfg = { 0 };                 // api_key from NVS
            if (soniox_session_start(&scfg, on_partial, on_turn, NULL) != ESP_OK) {
                s_listening = false;
                net_low_latency(false);                // no turn will run; restore power-save now
                chat_ui_status("STT error");
                ESP_LOGE(TAG, "STT failed to start");
            }
        } else if (ev == 0 && s_listening) {           // RELEASE
            s_listening = false;
            soniox_session_stop();                     // ws task is gone after this; buffers are stable
            char turn[1024];
            snprintf(turn, sizeof turn, "%s%s", s_ptt_final, s_ptt_run);
            char *t = turn;                            // trim surrounding whitespace
            while (*t == ' ' || *t == '\t') t++;
            size_t n = strlen(t);
            while (n && (t[n-1] == ' ' || t[n-1] == '\t' || t[n-1] == '\n')) t[--n] = '\0';
            if (*t) run_agent_turn(t);             // owns its terminal status (idle hint / "Error")
            else    chat_ui_status(IDLE_HINT);
            net_low_latency(false);                // turn done (reply streamed) → back to power-save

