contextablemark/esp32-agui/agui-voice/main/agui_voice_main.c
        } else if (ev == 2 && !s_listening) {      // DOUBLE-TAP → reopen setup portal (change endpoint etc.)
            chat_ui_status("Setup: join 'AMOLED-setup'");
            ESP_LOGI(TAG, "reconfigure: opening portal (only entered fields are saved)");
            net_portal_start("AMOLED-setup");
            bool saved = net_portal_wait_saved(180000);   // up to 3 min, then auto-close
            net_portal_stop();
            ESP_LOGI(TAG, "reconfigure: %s", saved ? "saved" : "timed out");
            if (saved) apply_timezone();   // P5: TZ may have changed in the portal
            chat_ui_status(IDLE_HINT);
        }
    }
}

// Any BOOT-button interaction wakes the display (note_activity un-arms a PWR-forced-off screen too),
// so reaching for the button to talk lights the screen even if it had blanked.
static void ptt_down_cb(void *btn, void *ctx) { chat_ui_note_activity(); int e = 1; xQueueSend(s_ptt_q, &e, 0); }  // hold → talk
static void ptt_up_cb(void *btn, void *ctx)   { chat_ui_note_activity(); int e = 0; xQueueSend(s_ptt_q, &e, 0); }  // release
static void ptt_dbl_cb(void *btn, void *ctx)  { chat_ui_note_activity(); int e = 2; xQueueSend(s_ptt_q, &e, 0); }  // double-tap → setup

static esp_err_t ptt_button_init(void)
{
    // Hold (>= long_press_time) = talk; a quick tap or double-tap does NOT start a turn, so a
    // double-tap can open the setup portal without colliding with hold-to-talk.
    button_config_t bcfg = { .long_press_time = 300 };
    button_gpio_config_t gcfg = { .gpio_num = PTT_GPIO, .active_level = 0 };   // BOOT pulls GPIO0 low
    button_handle_t btn;
    esp_err_t err = iot_button_new_gpio_device(&bcfg, &gcfg, &btn);
    if (err != ESP_OK) return err;
    iot_button_register_cb(btn, BUTTON_LONG_PRESS_START, NULL, ptt_down_cb, NULL);  // hold → start
    iot_button_register_cb(btn, BUTTON_PRESS_UP,         NULL, ptt_up_cb,   NULL);  // release → stop + run
    iot_button_register_cb(btn, BUTTON_DOUBLE_CLICK,     NULL, ptt_dbl_cb,  NULL);  // double-tap → setup portal
    return ESP_OK;
}

// A firing timer RINGS until the screen is tapped: bursts of 4 quick beeps with a big red ring
// flashing on/off in sync, then a dark pause, repeating — and getting LOUDER every few cycles. Runs
// on the timer task. chat_ui_alarm_set() shows the red-ring overlay + suspends the idle power-saver;
// we poll chat_ui_touch_idle_ms() for the dismiss tap (object-independent, so a tap anywhere counts).
// Auto-stops after ALARM_MAX_MS, or if BOOT is held to start a turn (s_listening).
#define ALARM_BRIGHT     90
#define ALARM_BEEPS      4
#define ALARM_GAP_MS     150
#define ALARM_PAUSE_MS   900
#define ALARM_MAX_MS     120000
#define ALARM_CYCLES_PER_LEVEL 4   // beep cycles at each loudness before stepping up
// Escalating loudness — int16 amplitudes (~/32767 of full scale). Start ~half the comfortable level
// and step up every ALARM_CYCLES_PER_LEVEL cycles until dismissed; top stays clear of clipping.
static const int ALARM_LEVELS[] = { 6500, 10000, 15000, 21000, 28000 };  // ~0.20,0.30,0.46,0.64,0.85 FS
#define ALARM_NLEVELS ((int)(sizeof ALARM_LEVELS / sizeof ALARM_LEVELS[0]))

// True once a fresh dismiss tap is seen — but only after the screen has first gone quiet, so a tap
// just before the timer fired doesn't instantly dismiss it. `*armed` persists across calls.
static bool alarm_dismiss_tap(bool *armed)
{
    uint32_t ti = chat_ui_touch_idle_ms();
    if (ti > 600) *armed = true;            // quiet (finger up / no recent touch) → ready to accept a tap
    return *armed && ti < 250;              // a touch within the last 250ms
}

static void run_timer_alarm(const char *label)
{
    chat_ui_note_activity();
    chat_ui_alarm_set(true);                 // black overlay + red ring; suspends the idle saver

    int64_t start = esp_timer_get_time();
    bool armed = false, done = false;
    int  cycle = 0, level = -1;
    while (!done && !s_listening && (esp_timer_get_time() - start) < (int64_t)ALARM_MAX_MS * 1000) {
        int want = cycle / ALARM_CYCLES_PER_LEVEL;            // escalate loudness over cycles
        if (want >= ALARM_NLEVELS) want = ALARM_NLEVELS - 1;
        if (want != level) { level = want; fill_tone(s_alarm_pcm, ALARM_FREQ, ALARM_LEVELS[level]); }

        for (int i = 0; i < ALARM_BEEPS && !done; i++) {
            chat_ui_alarm_flash(true);           // red ring ON (LVGL paints it; panel stays lit)…
            vTaskDelay(pdMS_TO_TICKS(20));        // let the "on" frame land before the beep
            play_beep(s_alarm_pcm);              // ~90ms (blocks)
            chat_ui_alarm_flash(false);          // …ring hidden (dark) between
            vTaskDelay(pdMS_TO_TICKS(ALARM_GAP_MS));
            if (alarm_dismiss_tap(&armed) || s_listening) done = true;
        }
        for (int t = 0; t < ALARM_PAUSE_MS && !done; t += 50) {   // dark pause, polling for the tap
            vTaskDelay(pdMS_TO_TICKS(50));
            if (alarm_dismiss_tap(&armed) || s_listening) done = true;
        }
        cycle++;
    }
    chat_ui_alarm_set(false);                // remove overlay; resume saver; screen on
    bsp_display_brightness_set(ALARM_BRIGHT);
    char msg[72];
    snprintf(msg, sizeof msg, "Timer done%s%s", label[0] ? ": " : "", label);
    chat_ui_status(msg);
}

// Poll the device timer (~1s): when a set_timer elapses, ring the alarm until the screen is tapped.
static void timer_alert_task(void *arg)
{
    QueueHandle_t q = device_tools_timer_queue();
    char label[40];
    for (;;) {
        uint8_t sig;
        xQueueReceive(q, &sig, portMAX_DELAY);   // BLOCKS until a set_timer fires — no periodic wake,
        if (device_tools_timer_take_fired(label, sizeof label))   // so the CPU can light-sleep until then
            run_timer_alarm(label);
    }
}

void app_main(void)
{
    ESP_LOGI(TAG, "AG-UI voice client booting (P0-P3)");
    init_nvs();

    device_tools_init();
    chat_ui_init();
    agui_client_init();

    // Provision until we have WiFi + Soniox key + AG-UI URL.
    ESP_ERROR_CHECK(net_prov_init());
    for (;;) {
        bool wifi_ok = net_is_connected() || (net_connect_saved(15000) == ESP_OK);
        bool key_ok  = app_cfg_has(APP_CFG_SONIOX_KEY);
        bool url_ok  = app_cfg_has(APP_CFG_AGUI_URL);
        if (wifi_ok && key_ok && url_ok) break;
        chat_ui_status("Setup: join 'AMOLED-setup'");
        ESP_LOGW(TAG, "provisioning (wifi=%d key=%d url=%d) — opening 'AMOLED-setup'", wifi_ok, key_ok, url_ok);
        net_portal_start("AMOLED-setup");
        net_portal_wait_saved(0);
        net_portal_stop();
    }
    net_start_auto_reconnect();
    apply_timezone();                  // P5: load POSIX TZ (default UTC0) for local_time
    net_sntp_start();                  // P5: sync wall-clock time for ambient context (local_time)
    ESP_LOGI(TAG, "network + keys ready");

