contextablemark/esp32-agui/agui-voice/main/agui_voice_main.c
    // Bring the mic up now; the Soniox WSS opens only on a PTT press.
    if (soniox_client_init() != ESP_OK) ESP_LOGE(TAG, "mic init failed");

    // P3: BOOT-button push-to-talk.
    s_ptt_q = xQueueCreate(4, sizeof(int));
    // agui_run runs on this stack: TLS handshake + the C++ SDK (nlohmann JSON serialize/parse is
    // recursive + C++ exception unwinding), so it needs more headroom than the old cJSON path.
    xTaskCreate(ptt_task, "ptt", 16384, NULL, 5, NULL);
    xTaskCreate(timer_alert_task, "tmralert", 4096, NULL, 3, NULL);   // P7: surface set_timer firings
    if (ptt_button_init() != ESP_OK) ESP_LOGE(TAG, "PTT button init failed");
    chat_ui_status(IDLE_HINT);
    chat_ui_set_power_cb(lp_set);       // low-power: shed WiFi when the display blanks (on battery), restore on wake
    chat_ui_screen_power_start(60);    // power saver: blank the AMOLED after 60s idle; wake on touch / PWR key / activity
    ESP_LOGI(TAG, "ready — hold BOOT (GPIO0) to talk");

    // Heartbeat: link + heap (internal RAM is the scarce one with the display).
    char ip[16];
    for (;;) {
        vTaskDelay(pdMS_TO_TICKS(15000));
        if (net_get_ip_str(ip, sizeof ip)) {
            if (!net_time_synced()) net_time_http_fallback();   // P5: set clock via HTTPS if NTP is blocked
            // internal_max = largest contiguous internal block — TLS/lwIP send buffers need
            // contiguous internal RAM, so this matters more than total free when sessions fail.
            ESP_LOGI(TAG, "heartbeat: online ip=%s listening=%d free=%u internal=%u internal_max=%u psram=%u",
                     ip, s_listening, (unsigned)esp_get_free_heap_size(),
                     (unsigned)heap_caps_get_free_size(MALLOC_CAP_INTERNAL),
                     (unsigned)heap_caps_get_largest_free_block(MALLOC_CAP_INTERNAL),
                     (unsigned)heap_caps_get_free_size(MALLOC_CAP_SPIRAM));
        } else {
            ESP_LOGW(TAG, "heartbeat: offline");
        }
    }
}
